cmsis-svd/cmsis-svd/data/SiliconLabs/SIM3L1x6_SVD.xml
			</registers>
		</peripheral>
		<peripheral>
			<name>DTM_2</name>
			<version>A</version>
			<description>None</description>
			<groupName>DTM</groupName>
			<baseAddress>0x4004c000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>DTM2_IRQn</name>
				<value>34</value>
			</interrupt>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>CONTROL</name>
					<description>Module Control</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x0600FF00</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>STCOUNT</name>
							<description>Active State Counter. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>ST</name>
							<description>Active State. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>LASTST</name>
							<description>Last State. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>INHSSEL</name>
							<description>Inhibit Signal Select. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DTMNINH0</name>
									<description>Select inhibit signal source DTMnINH.0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNINH1</name>
									<description>Select inhibit signal source DTMnINH.1.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNINH2</name>
									<description>Select inhibit signal source DTMnINH.2.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNINH3</name>
									<description>Select inhibit signal source DTMnINH.3.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNINH4</name>
									<description>Select inhibit signal source DTMnINH.4.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNINH5</name>
									<description>Select inhibit signal source DTMnINH.5.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNINH6</name>
									<description>Select inhibit signal source DTMnINH.6.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNINH7</name>
									<description>Select inhibit signal source DTMnINH.7.</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNINH8</name>
									<description>Select inhibit signal source DTMnINH.8.</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNINH9</name>
									<description>Select inhibit signal source DTMnINH.9.</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNINH10</name>
									<description>Select inhibit signal source DTMnINH.10.</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNINH11</name>
									<description>Select inhibit signal source DTMnINH.11.</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNINH12</name>
									<description>Select inhibit signal source DTMnINH.12.</description>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNINH13</name>
									<description>Select inhibit signal source DTMnINH.13.</description>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNINH14</name>
									<description>Select inhibit signal source DTMnINH.14.</description>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNINH15</name>
									<description>Select inhibit signal source DTMnINH.15.</description>
									<value>15</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DBGMD</name>
							<description>Debug Mode. </description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>RUN</name>
									<description>The DTM module will continue to operate while the core is halted in debug mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HALT</name>
									<description>A debug breakpoint will cause the DTM module to halt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INHF</name>
							<description>Inhibit Status Flag. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>The inhibit signal is inactive.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>The inhibit signal is active.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DSTREQF</name>
							<description>Destination Peripheral DMA Request Status Flag. </description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>The destination peripheral did not request a DMA transfer.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>The destination peripheral requested a DMA transfer.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRCREQF</name>
							<description>Source Peripheral DMA Request Status Flag. </description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>The source peripheral did not request a DMA transfer.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>The source peripheral requested a DMA transfer.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DTMINH</name>
							<description>DTM Module Inhibit. </description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>The DTM module does not ignore DMA requests.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>The DTM module ignores DMA requests until this bit is cleared.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TOERRI</name>
							<description>Timeout Error Interrupt Flag. </description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>A timeout error has not occurred.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>A timeout error occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DMAERRI</name>
							<description>DMA Error Interrupt Flag. </description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>A DMA error has not occurred.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>A DMA error occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DTMI</name>
							<description>Module Interrupt Flag. </description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>A state transition or timeout has not occurred.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>A state transition (SECSTIEN or PRISTIEN set to 1) or timeout (TOERRIEN = 1) occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DTMEN</name>
							<description>Module Enable. </description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the DTM module.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the DTM module.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMEOUT</name>
					<description>Module Timeout</description>
					<addressOffset>0x10</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TORELOAD</name>
							<description>Timeout Counter Reload. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>TOCOUNT</name>
							<description>Timeout Counter. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>MSTCOUNT</name>
					<description>Master Counter</description>
					<addressOffset>0x20</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MSTCOUNT</name>
							<description>Master Counter. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>STATEADDR</name>
					<description>State Address</description>
					<addressOffset>0x30</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>STATEADDR</name>
							<description>State Address. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>30</bitWidth>
						</field>
					</fields>
				</register>
