cmsis-svd/cmsis-svd/data/SiliconLabs/SIM3L1x6_SVD.xml
				<register>
					<name>STATE</name>
					<description>Active DTM State</description>
					<addressOffset>0x40</addressOffset>
					<resetValue>0x00FFFF00</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>STRELOAD</name>
							<description>Active State Counter Reload. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SECST</name>
							<description>Secondary State. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PRIST</name>
							<description>Primary State. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DSTMOD</name>
							<description>Destination Module. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DTMNDST0</name>
									<description>Select destination module DTMnDST.0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNDST1</name>
									<description>Select destination module DTMnDST.1.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNDST2</name>
									<description>Select destination module DTMnDST.2.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNDST3</name>
									<description>Select destination module DTMnDST.3.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNDST4</name>
									<description>Select destination module DTMnDST.4.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNDST5</name>
									<description>Select destination module DTMnDST.5.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNDST6</name>
									<description>Select destination module DTMnDST.6.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNDST7</name>
									<description>Select destination module DTMnDST.7.</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNDST8</name>
									<description>Select destination module DTMnDST.8.</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNDST9</name>
									<description>Select destination module DTMnDST.9.</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNDST10</name>
									<description>Select destination module DTMnDST.10.</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNDST11</name>
									<description>Select destination module DTMnDST.11.</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNDST12</name>
									<description>Select destination module DTMnDST.12.</description>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNDST13</name>
									<description>Select destination module DTMnDST.13.</description>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNDST14</name>
									<description>Select destination module DTMnDST.14.</description>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNDST15</name>
									<description>Select no destination module (DTMnDST.15).</description>
									<value>15</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRCMOD</name>
							<description>Source Module. </description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DTMNSRC0</name>
									<description>Select source module DTMnSRC.0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNSRC1</name>
									<description>Select source module DTMnSRC.1.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNSRC2</name>
									<description>Select source module DTMnSRC.2.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNSRC3</name>
									<description>Select source module DTMnSRC.3.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNSRC4</name>
									<description>Select source module DTMnSRC.4.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNSRC5</name>
									<description>Select source module DTMnSRC.5.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNSRC6</name>
									<description>Select source module DTMnSRC.6.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNSRC7</name>
									<description>Select source module DTMnSRC.7.</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNSRC8</name>
									<description>Select source module DTMnSRC.8.</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNSRC9</name>
									<description>Select source module DTMnSRC.9.</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNSRC10</name>
									<description>Select source module DTMnSRC.10.</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNSRC11</name>
									<description>Select source module DTMnSRC.11.</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNSRC12</name>
									<description>Select source module DTMnSRC.12.</description>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNSRC13</name>
									<description>Select source module DTMnSRC.13.</description>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNSRC14</name>
									<description>Select source module DTMnSRC.14.</description>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTMNSRC15</name>
									<description>Select no source module (DTMnSRC.15).</description>
									<value>15</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DTMCHSEL</name>
							<description>DTM Channel Select. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH_A</name>
									<description>Select DTMn channel A for this state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH_B</name>
									<description>Select DTMn channel B for this state.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH_C</name>
									<description>Select DTMn channel C for this state.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH_D</name>
									<description>Select DTMn channel D for this state.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INHSPOL</name>
							<description>Inhibit Signal Polarity. </description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ACTIVE_LOW</name>
									<description>A logic low on the pin selected by INHSEL will allow the DTM to proceed.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_HIGH</name>
									<description>A logic high on the pin selected by INHSEL will allow the DTM to proceed.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DTMINH</name>
							<description>Module Inhibit Enable. </description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>The DTM module does not ignore any DMA requests.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>The DTM module ignores all DMA requests until the inhibit signal selected by INHSSEL matches the polarity polarity set by INHSPOL.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSTDECEN</name>
							<description>Master Decrement Enable. </description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable master counter decrements.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable master counter decrements.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TOERRIEN</name>
							<description>Timeout Enable. </description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable timeouts and timeout interrupts.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable timeouts and timeout interrupts.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SECSTIEN</name>
							<description>Secondary State Transition Interrupt Enable. </description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable secondary state transition interrupts.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable secondary state transition interrupts.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PRISTIEN</name>
							<description>Primary State Transition Interrupt Enable. </description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable primary state transition interrupts.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable primary state transition interrupts.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
