cmsis-svd/cmsis-svd/data/SiliconLabs/SIM3L1x6_SVD.xml
			</registers>
		</peripheral>
		<peripheral>
			<name>PLL_0</name>
			<version>A</version>
			<description>None</description>
			<groupName>Oscillators</groupName>
			<baseAddress>0x4003b000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>PLL0_IRQn</name>
				<value>43</value>
			</interrupt>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>DIVIDER</name>
					<description>Reference Divider Setting</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>M</name>
							<description>M Divider Value. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
						<field>
							<name>N</name>
							<description>N Divider Value. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CONTROL</name>
					<description>Module Control</description>
					<addressOffset>0x10</addressOffset>
					<resetValue>0x00010800</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LLMTF</name>
							<description>CAL Saturation (Low) Flag. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>DCO period is not saturated low.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>DCO period is saturated low.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HLMTF</name>
							<description>CAL Saturation (High) Flag. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>DCO period is not saturated high.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>DCO period is saturated high.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LCKI</name>
							<description>Phase-Lock and Frequency-Lock Locked Interrupt Flag. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>DCO is disabled or not locked.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>DCO is enabled and locked.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LMTIEN</name>
							<description>Limit Interrupt Enable. </description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Saturation (high and low) interrupt disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Saturation (high and low) interrupt enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LCKIEN</name>
							<description>Locked Interrupt Enable. </description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The PLL locking does not cause an interrupt</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>An interrupt is generated if LCKI matches the state selected by LCKPOL.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LCKPOL</name>
							<description>Lock Interrupt Polarity. </description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ACTIVE_LOW</name>
									<description>The lock state PLL interrupt will occur when LCKI is 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_HIGH</name>
									<description>The lock state PLL interrupt will occur when LCKI is 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REFSEL</name>
							<description>Reference Clock Selection Control. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>RTC0TCLK</name>
									<description>PLL reference clock (FREF) is the RTC0 oscillator (RTC0TCLK).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LPOSC0DIV</name>
									<description>PLL reference clock (FREF) is the divided Low Power Oscillator (LPOSC0).</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXTOSC0</name>
									<description>PLL reference clock (FREF) is the external oscillator output (EXTOSC0).</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LOCKTH</name>
							<description>Lock Threshold Control. </description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>STALL</name>
							<description>DCO Output Updates Stall. </description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>In phase-lock and frequency-lock modes, spectrum spreading, and dithering operate normally, if enabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>In phase-lock and frequency-lock modes, spectrum spreading, and dithering are prevented from updating the output of the DCO.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DITHEN</name>
							<description>Dithering Enable. </description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Automatic DCO output dithering disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Automatic DCO output dithering enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EDGSEL</name>
							<description>Edge Lock Select. </description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>FALLING_EDGE</name>
									<description>Lock DCO output frequency to the falling edge of the reference frequency.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISING_EDGE</name>
									<description>Lock DCO output frequency to the rising edge of the reference frequency.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OUTMD</name>
							<description>PLL Output Mode. </description>
							<bitOffset>30</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
									<description>DCO output is off.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DCO</name>
									<description>DCO output is in Free-Running DCO mode.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FLL</name>
									<description>DCO output is in frequency-lock mode (reference source required).</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PLL</name>
									<description>DCO output is in phase-lock mode (reference source required).</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SSPR</name>
					<description>Spectrum Spreading Control</description>
					<addressOffset>0x20</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SSAMP</name>
							<description>Spectrum Spreading Amplitude. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable Spectrum Spreading.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SETTING1</name>
									<description>Spectrum Spreading set to approximately +/- 0.1% of TDCO.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SETTING2</name>
									<description>Spectrum Spreading set to approximately +/- 0.2% of TDCO.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SETTING3</name>
									<description>Spectrum Spreading set to approximately +/- 0.4% of TDCO.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SETTING4</name>
									<description>Spectrum Spreading set to approximately +/- 0.8% of TDCO.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SETTING5</name>
									<description>Spectrum Spreading set to approximately +/- 1.6% of TDCO.</description>
									<value>5</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SSUINV</name>
							<description>Spectrum Spreading Update Interval. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CALCONFIG</name>
					<description>Calibration Configuration</description>
					<addressOffset>0x30</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DITHER</name>
							<description>DCO Dither Setting. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>CAL</name>
							<description>DCO Calibration Value. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
						<field>
							<name>RANGE</name>
							<description>DCO Range. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>RANGE0</name>
									<description>DCO operates from 23 to 37 MHz.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RANGE1</name>
									<description>DCO operates from 33 to 50 MHz.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RANGE2</name>
									<description>DCO operates from 45 to 50 MHz.</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
